app/services/courses_service.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."course_id" = ?  [["course_id", 14]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN (?, ?) LIMIT ? OFFSET ?  [["id", 14], ["id", 15], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index(params)
    @params = params
    if params[:student_id] and params[:tutor_id]
      courses_with_student = Course.joins(:enrollments).where(enrollments: { user_id: params[:student_id] }).where(user_id: params[:tutor_id]).limit(limit).offset(offset).pluck(:title, :description, :user_id)
      @courses = courses_with_student.where(user_id: params[:tutor_id]).limit(limit).offset(offset).pluck(:title, :description, :user_id)
      @courses = @courses.map { |title, description, user_id| { student: User.find(params[:student_id]).fullname, title: title, description: description, creator: User.find(user_id).fullname } }.as_json

    elsif params[:tutor_id]
      @courses = Course.where(user_id: params[:tutor_id]).limit(limit).offset(offset).pluck(:title, :description, :user_id)
      @courses = @courses.map { |title, description, user_id| { title: title, description: description, creator: User.find(user_id).fullname } }.as_json
    elsif params[:student_id]
      @courses = Course.where(id: Enrollment.where(user_id: params[:student_id]).limit(limit).offset(offset).pluck(:course_id)).pluck(:title, :description, :user_id)
      @courses = @courses.map { |title, description, user_id| { student: User.find(params[:student_id]).fullname, title: title, description: description, creator: User.find(user_id).fullname } }.as_json
    elsif not params[:student_id] and not params[:tutor_id]
      @courses = Course.all.limit(limit).offset(offset).pluck(:title, :description, :user_id)
      @courses = @courses.map {|title, description, user_id| {title: title, description: description, creator: User.find(user_id).fullname}}.as_json