app/services/courses_service.rb

  def index
    if params[:student_id] && params[:tutor_id]
      @courses = Course.courses_by_teacher_and_student(params[:student_id], params[:tutor_id]).limits(limit, offset)
    elsif params[:tutor_id]
      @courses = Course.courses_by_teacher(params[:tutor_id]).limits(limit, offset)
    elsif params[:student_id]
      @courses = Course.courses_by_student(params[:student_id]).limits(limit, offset).pluck('title', 'description',
                                                                                            'user_id')
      @courses = @courses.map do |title, description, user_id|
        { student: User.find(params[:student_id]).fullname, title:, description:,
          creator: User.find(user_id).fullname }.as_json
      end
      return @courses
    else
      @courses = Course.all.limits(limit, offset)
    end
    @courses.map do |elem|
      CoursesBlueprint.render_as_json(elem, fullname: User.find(elem[:user_id])[:fullname])
---
SELECT "courses"."title", "courses"."description", "courses"."user_id" FROM "courses" WHERE "courses"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 77], ["LIMIT", 1], ["OFFSET", 0]]
SELECT "courses".* FROM "courses" INNER JOIN "enrollments" ON "enrollments"."course_id" = "courses"."id" WHERE "courses"."user_id" = ?  [["user_id", 80]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 77], ["LIMIT", 1]]
SELECT users.fullname, courses.description, courses.title, courses.users_id FROM "courses" INNER JOIN "enrollments" ON "enrollments"."course_id" = "courses"."id" INNER JOIN "users" ON "users"."id" = "enrollments"."user_id" WHERE "courses"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 77], ["LIMIT", 10], ["OFFSET", 0]]
SELECT users.fullname, courses.description, courses.title, courses.user_id FROM "courses" INNER JOIN "enrollments" ON "enrollments"."course_id" = "courses"."id" INNER JOIN "users" ON "users"."id" = "enrollments"."user_id" WHERE "courses"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 77], ["LIMIT", 10], ["OFFSET", 0]]

  def subscribe
    return { data: '403 Forbidden', status: 403 } unless @user.root.eql? 1

    course = Course.find_by(id: params[:id])
    return { data: 'Course was not found', status: :unprocessable_entity } unless course

    enrollment = @user.enrollments.create(course_id: params[:id])
    return { data: {}, status: :ok } if enrollment.save
---
INSERT INTO "enrollments" ("user_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 80], ["course_id", 15], ["created_at", "2024-04-20 16:41:53.725148"], ["updated_at", "2024-04-20 16:41:53.725148"]]

  def show
    course = Course.find_by(id: params[:id])
    return {} unless course

    ids = []
    Enrollment.where(course_id: course.id).each do |enrollment|
      ids.append(enrollment.user_id)
    end
    students = User.where(id: ids)
    { json: { title: course.title, description: course.description, fullname: User.find(course.user_id).fullname,
              students: students.pluck(:fullname) } }
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."course_id" = ?  [["course_id", 14]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 77], ["LIMIT", 1]]
SELECT "users"."fullname" FROM "users" WHERE "users"."id" = ?  [["id", 80]]