app/services/session_service.rb

  def find_user(params)
    user = User.find_by(email: params[:email])
    return { error: "Wrong email or password", status: :unauthorized } unless user
    return { error: "Wrong email or password", status: :unauthorized } unless BCrypt::Password.new(user.password) == params[:password]
    payload = { id: user.id, email: params[:email], password: params[:password], root: user.root, created_at: Time.now() }
    token = (JWT.encode payload, "SK", "HS256")[0..-2]
    user.validation_jwt = SecureRandom.hex(8)
    user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "email_student2@mail.ru"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "validation_jwt" = ? WHERE "users"."id" = ?  [["updated_at", "2024-04-08 14:07:58.745425"], ["validation_jwt", "93e494498de4190a"], ["id", 80]]