app/services/validation_service.rb

  def execute
    begin
      return unless request.headers.key?(:Authorization)

      token = request.headers['Authorization'][7..]
      decoded_token = JWT.decode(token, 'SK', false, { algorithm: 'HS256' })

      user = User.find_by(id: decoded_token.first['id'], email: decoded_token.first['email'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? AND "users"."email" = ? LIMIT ?  [["id", 77], ["email", "email_teacher1@mail.ru"], ["LIMIT", 1]]