app/controllers/api/courses_controller.rb

INSERT INTO "courses" ("title", "user_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Russian"], ["user_id", 20], ["description", "good subject"], ["created_at", "2024-04-03 13:36:14.194255"], ["updated_at", "2024-04-03 13:36:14.194255"]]
---
  def create
    ans = @service.create_course(@token, course_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def check_user_auth
    return if request.eql? nil
    return unless request.headers.key?(:Authorization)
    decoded_token = JWT.decode(request.headers['Authorization'][7..-1], "SK", false, {algorithm: "HS256"})
    user = User.find_by(id: decoded_token[0]["id"], email: decoded_token[0]["email"])