app/controllers/api/registration_controller.rb

INSERT INTO "users" ("fullname", "email", "password", "root", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["fullname", "Учитель"], ["email", "testTeacher"], ["password", "[FILTERED]"], ["root", 2], ["created_at", "2024-04-03 11:27:55.986440"], ["updated_at", "2024-04-03 11:27:55.986440"]]
---
  def create
    @user = User.new(user_params)
    if @user.save