app/controllers/api/session_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "validation_jwt" = ? WHERE "users"."id" = ?  [["updated_at", "2024-04-04 20:16:16.315189"], ["validation_jwt", "9282c5aac444e912"], ["id", 77]]

  def set_user
    if params[:id]
      @user = User.find(params[:id])
    else
      @user = User.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]