app/models/course.rb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = ?  [["user_id", 80]]
SELECT users.fullname, courses.description, courses.title FROM "courses" INNER JOIN "enrollments" ON "enrollments"."course_id" = "courses"."id" INNER JOIN "users" ON "users"."id" = "enrollments"."user_id" WHERE "courses"."user_id" = ?  [["user_id", 77]]
---
  scope :courses_by_teacher_and_student, lambda { |student_id, teacher_id|
    joins(:enrollments).where(enrollments: { user_id: student_id }).courses_by_teacher(teacher_id)